src/InformationRegisters/МониторингЗаказаПредыдущийРасчет/МониторингЗаказаПредыдущийРасчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МониторингЗаказаПредыдущийРасчет</name>
  <resources>
    <name>ПериодРасчета</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ВремяВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОбеспеченности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентГотовности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЗаказНаПроизводство</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство2_2</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/МониторингЗаказаПредыдущийРасчет/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаписатьСведения(Данные) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Набор = РегистрыСведений.МониторингЗаказаПредыдущийРасчет.СоздатьНаборЗаписей();
	Набор.Отбор.ЗаказНаПроизводство.Установить(Данные.ЗаказНаПроизводство);
	ЗаполнитьЗначенияСвойств(Набор.Добавить(), Данные);
	Набор.Записать(Истина);
	
КонецПроцедуры

Функция ПолучитьСведения(ЗаказНаПроизводство) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СведенияОРасчете = РегистрыСведений.МониторингЗаказаПредыдущийРасчет.СоздатьМенеджерЗаписи();
	СведенияОРасчете.ЗаказНаПроизводство = ЗаказНаПроизводство;
	СведенияОРасчете.Прочитать();

	Если Не СведенияОРасчете.Выбран() Тогда
		// Значения по умолчанию
		СведенияОРасчете.ВремяВыполнения = 0;
		СведенияОРасчете.ПериодРасчета = '00010101';
		СведенияОРасчете.ПроцентОбеспеченности = 0;
		СведенияОРасчете.ПроцентГотовности = 0;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(
		СведенияОРасчете, Метаданные.РегистрыСведений.МониторингЗаказаПредыдущийРасчет);
	
КонецФункции

#КонецОбласти

#КонецЕсли
